day = 0  # អថេរ day សម្រាប់កំណត់តំណាងថ្ងៃកំណើត
# អ្នកប្រើប្រាស់បញ្ចូលចម្លើយសំណួរទី១
question1 = "តើមានថ្ងៃកំណើតអ្នកនៅក្នុងសំណុំទី១ នេះដែរឬទេ?\n" + \
            " 1  3  5  7\n" + \
            " 9 11 13 15\n" + "17 19 21 23\n" + \
            "25 27 29 31" + \
            "\nបញ្ចូល 0 បើគ្មានថ្ងៃកំណើតអ្នក និង 1 បើមានថ្ងៃកំណើតអ្នក៖ "
answer = eval(input(question1))
if answer == 1:
    day += 1
# អ្នកប្រើប្រាស់បញ្ចូលចម្លើយសំណួរទី២
question2 = "តើមានថ្ងៃកំណើតអ្នកនៅក្នុងសំណុំទី២ នេះដែរឬទេ?\n" + \
            " 2  3  6  7\n" + \
            "10 11 14 15\n" + \
            "18 19 22 23\n" + \
            "26 27 30 31" + \
            "\nបញ្ចូល 0 បើគ្មានថ្ងៃកំណើតអ្នក និង 1 បើមានថ្ងៃកំណើតអ្នក៖ "
answer = eval(input(question2))
if answer == 1:
    day += 2
# អ្នកប្រើប្រាស់បញ្ចូលចម្លើយសំណួរទី៣
question3 = "តើមានថ្ងៃកំណើតអ្នកនៅក្នុងសំណុំទី៣ នេះដែរឬទេ?\n" + \
            " 4  5  6  7\n" + \
            "12 13 14 15\n" + \
            "20 21 22 23\n" + \
            "28 29 30 31" + \
            "\nបញ្ចូល 0 បើគ្មានថ្ងៃកំណើតអ្នក និង 1 បើមានថ្ងៃកំណើតអ្នក៖ "
answer = eval(input(question3))
if answer == 1:
    day += 4
# អ្នកប្រើប្រាស់បញ្ចូលចម្លើយសំណួរទី៤
question4 = "តើមានថ្ងៃកំណើតអ្នកនៅក្នុងសំណុំទី៤ នេះដែរឬទេ?\n" + \
            " 8  9 10 11\n" + \
            "12 13 14 15\n" + \
            "24 25 26 27\n" + \
            "28 29 30 31" + \
            "\nបញ្ចូល 0 បើគ្មានថ្ងៃកំណើតអ្នក និង 1 បើមានថ្ងៃកំណើតអ្នក៖ "
answer = eval(input(question4))
if answer == 1:
    day += 8
# អ្នកប្រើប្រាស់បញ្ចូលចម្លើយសំណួរទី៥
question5 = "តើមានថ្ងៃកំណើតអ្នកនៅក្នុងសំណុំទី៥ នេះដែរឬទេ?\n" + \
            "16 17 18 19\n" + \
            "20 21 22 23\n" + \
            "24 25 26 27\n" + \
            "28 29 30 31" + \
            "\nបញ្ចូល 0 បើគ្មានថ្ងៃកំណើតអ្នក និង 1 បើមានថ្ងៃកំណើតអ្នក៖ "
answer = eval(input(question5))
if answer == 1:
    day += 16
print("\nថ្ងៃកំណើតរបស់អ្នកគឺ " + str(day))
