NUMBER_OF_PRIMES = 50   #ចំនួនបឋមសរុបដែលចង់រក
NUMBER_OF_PRIMES_PER_LINE = 10 # ដើម្បីធ្វើប្រមាណវិធីពេលមួយបន្ទាត់មានចំនួនបឋម ១០ លេខហើយត្រូវផ្ដើមបន្ទាត់ថ្មី
numbers = 2 # ចំនួនបឋមដំបូងចាប់ផ្ដើមពីលេខដែលមានតម្លៃ 2
count = 0  # អថេរសម្រាប់រាប់ចំនួនបឋមដែលបានរកឃើញ
while count < NUMBER_OF_PRIMES:  #រង្វិលជុំដើម្បីរក និងរាប់ចំនួនបឋមពេលគ្រប់ 50 រង្វិលជុំនឹងចប់
    isPrime = True  #ផ្ដើមតម្លៃឱ្យអថេរប៊ូលីន True ដើម្បីធ្វើតេស្ដអថេរ numbers ជាចំនួនបឋម ឬអត់
    for divisor in range(2, int(numbers / 2) + 1):  #ធ្វើរង្វិលជុំដើម្បីរកចំនួនបឋមពីតម្លៃ 2, 3, 4 រហូតដល់ numbers/2
        if numbers % divisor == 0:  #ប្រសិន numbers ចែកដាច់នឹង 2, 3, 4 រហូតដល់ number / 2 នោះ numbers មិនមែនជាចំនួនបឋមទេ
            isPrime = False # បញ្ជាក់ថា numbers នោះមិនមែនជាចំនួនបឋម
            break   # ចាកចេញពីរង្វិលជុំខាងក្នុងព្រោះរកឃើញចំនួនបឋមរួចហើយ

    if isPrime: # ពិនិត្យថា numbers ជាចំនួនបឋមឬទេ
        count += 1  #បើ numbers ជាចំនួនបឋមនោះ អថេរ count ត្រូវបង្កើន 1
        print(format(numbers, "4d"), end="")    #បង្ហាញចំនួនបឋមនៅក្នុង console
        if count % NUMBER_OF_PRIMES_PER_LINE == 0:  # ពេលបង្ហាញបាន 10 លេខនោះត្រូវផ្ដើមបន្ទាត់សារជាថ្មី
            print()
    numbers += 1    #បង្កើនតម្លៃឱ្យអថេរ numbers ចំនួន 1 ដើម្បីរកចំនួនបឋមបន្តទៀត


