print("                             តារាងមេគុណ") # បង្ហាញចំណងជើងតារាងមេគុណ
print("              ", end='')
for j in range(1, 10):
    print("  ", j, end='') # end='' ប្រើដើម្បីកុំឱ្យចុះបន្ទាត់
print()  # ដើម្បីទៅបន្ទាត់ថ្មី
print("           ——————————————————————————————————————————")
for i in range(1, 10):
    print("           ",end='')
    # បង្ហាញតម្លៃនៃមេគុណនីមួយៗ
    print(i, "|", end='')
    for j in range(1, 10):
        # តម្លៃនៃមេគុណលេខ និងធ្វើទ្រង់ទ្រាយតារាង
        print(format(i * j, "4d"), end='')  # format(i * j, "4d") ធ្វើទ្រង់ទ្រាយនៃតម្លៃ i*j ដោយទុកចន្លោះ 4
    print()  # ដើម្បីទៅបន្ទាត់ថ្មី





